โจทย์ที่ผมเลือก เขียนโค้ดทายเลข1-10
i ; ตัวเลขที่ผู้เล่นพิมพ์ (1–10)
p ;สุ่มตัวเลข 1–10 เปรียบเทียบเลขที่ผู้เล่นใส่ กับเลขที่สุ่มครับ
o ; ผลรับจะแสดงออกก้ต่อเมื่อ เราสุ่มเลข ถ้าทายถูก จะบอกว่าถูก ถ้าทายผิดจะบอกวา่าผิด

ตัวแปรในโค้ด number เลขที่คอมสุ่ม (คำตอบ)
           guess เลขที่ผู้เล่นทาย 
2.1 ผมเลือก เพราะว่า ปกติ ที่ผมเรียน หรือเขียนโค้ดมา มึแต่ พวกสุ่มตัวเลข แล้วก้ ทายครับ เลยเลือกโปรแกรมนี้
2.2 ช่วยเขียนโค้ดภาษา Python สำหรับเกมทายเลข 1–10 โดยให้คอมพิวเตอร์สุ่มตัวเลข และให้ผู้เล่นพิมพ์คำตอบ พร้อมแสดงผลว่าถูกหรือผิด
2.3  ผทได้เพิ่มฟังก์ชั่น ที่ให้เครดิตผมแล้วก้ไถถามกับ ผู้ใช้เล้กน้อย
2.4 ผมได้เรียนรู้วิธีการเขียนโค้ด ในรูปแบบใหม่ๆ กับ ai
